IDENTIFICATION DIVISION.
PROGRAM-ID. TRANSACTIONS.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TRANS-FILE
        ASSIGN TO TRANS-IN
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD TRANS-FILE
    LABEL RECORDS ARE OMITTED
    RECORD CONTAINS 80 CHARACTERS.

WORKING-STORAGE SECTION.
01  TRANS-RECORD.
    05  ACCOUNT-NUMBER PIC 9(10).
    05  TRANSACTION-TYPE PIC X(1).
    05  TRANSACTION-AMOUNT PIC 9(10).V9(2).

PROCEDURE DIVISION.
    OPEN INPUT TRANS-FILE
    READ TRANS-FILE
        INTO TRANS-RECORD
        AT END SET EOF TO TRUE
    END-READ
    PERFORM UNTIL EOF
        ADD TRANSACTION-AMOUNT TO BALANCE
        READ TRANS-FILE
            INTO TRANS-RECORD
            AT END SET EOF TO TRUE
        END-READ
    END-PERFORM
    CLOSE TRANS-FILE
    STOP RUN.
